<!doctype html><html><head><title>存储基础</title>
<meta name="viewport" content="width=device-width,initial-scale=1"/>
<meta http-equiv="Content-Type" content="text/html; charset=gb2312">
<link href="../css/mobile.css" rel="stylesheet" />
<script type="text/javascript" src="../js/jquery.js"></script>
<script type="text/javascript" src="../js/mobile.js"></script>
<script type="text/javascript" src="../js/lightbox.js"></script>
<link rel="stylesheet" href="../css/lightbox.css" type="text/css">
<style>.kmimg{max-width:100%;height:auto;}</style>
</head>
<body bgcolor="#ffffff"><div data-role="page"><div data-role="header"><a data-rel="back" data-icon="back">返回</a><h1></h1><a href="../../index.html" data-role="button" data-icon="home" rel="external">首页</a></div><div style="padding:5px 5px 5px 5px" data-role="content">
<font size=3 color="#000000" face="Arial">
<p></p>
<p>&#22312;&#35745;&#31639;&#26426;&#25216;&#26415;&#20013;&#65288;&#29305;&#21035;&#26159;&#25968;&#25454;&#20256;&#36755;&#21644;&#25968;&#25454;&#23384;&#20648;&#65289;&#65292;&#22359;&#26159;&#19968;&#27573;&#26631;&#20934;&#38271;&#24230;&#65288;&#22359;&#22823;&#23567;&#65289;&#30340;&#23383;&#33410;&#25110;&#27604;&#29305;&#12290;&#22312;&#22788;&#29702;&#35745;&#31639;&#26426;&#31243;&#24207;&#20135;&#29983;&#30340;&#25968;&#25454;&#27969;&#26102;&#65292;&#22359;&#21270;&#25968;&#25454;&#21487;&#20197;&#31616;&#21270;&#22788;&#29702;&#36807;&#31243;&#12290;&#19968;&#33324;&#24773;&#20917;&#19979;&#65292;&#19968;&#27425;&#20250;&#35835;&#21462;&#19968;&#20010;&#23436;&#25972;&#30340;&#22359;&#12290;&#21521;9&#36712;&#30913;&#24102;&#12289;&#26059;&#36716;&#20171;&#36136;&#22914;&#36719;&#30424;&#12289;&#30828;&#30424;&#12289;&#20809;&#30424;&#21644;NAND&#38378;&#23384;&#23384;&#20648;&#25968;&#25454;&#26102;&#65292;&#22359;&#21270;&#25968;&#25454;&#20960;&#20046;&#26159;&#21807;&#19968;&#30340;&#36873;&#25321;&#12290;</p>
<p></p>
<p>&#22823;&#22810;&#25968;&#25991;&#20214;&#31995;&#32479;&#37117;&#26159;&#22522;&#20110;&#22359;&#35774;&#22791;&#65292;&#21363;&#23384;&#21462;&#35268;&#23450;&#25968;&#25454;&#22359;&#30340;&#30828;&#20214;&#25277;&#35937;&#23618;&#12290;&#26377;&#26102;&#25991;&#20214;&#31995;&#32479;&#20013;&#30340;&#22359;&#22823;&#23567;&#21487;&#33021;&#26159;&#29289;&#29702;&#22359;&#22823;&#23567;&#30340;&#20960;&#20493;&#12290;&#20256;&#32479;&#25991;&#20214;&#31995;&#32479;&#20013;&#65292;&#21333;&#20010;&#22359;&#21487;&#33021;&#21482;&#21253;&#21547;&#21333;&#20010;&#25991;&#20214;&#30340;&#19968;&#37096;&#20998;&#12290;&#20294;&#30001;&#20110;&#25991;&#20214;&#38271;&#24230;&#36890;&#24120;&#19981;&#26159;&#22359;&#22823;&#23567;&#30340;&#25972;&#25968;&#20493;&#65292;&#36825;&#26679;&#25991;&#20214;&#30340;&#26368;&#21518;&#19968;&#22359;&#19981;&#20250;&#23436;&#20840;&#22635;&#28385;&#65292;&#30001;&#27492;&#20135;&#29983;&#30340;&#20869;&#37096;&#30862;&#29255;&#20250;&#23548;&#33268;&#31354;&#38388;&#21033;&#29992;&#29575;&#19981;&#39640;&#12290;&#22240;&#27492;&#20250;&#26377;&#26494;&#25955;&#31354;&#38388;&#65288;slack space&#65289;&#65292;&#24179;&#22343;&#27599;&#20010;&#25991;&#20214;&#21322;&#22359;&#12290;&#19968;&#20123;&#36739;&#26032;&#30340;&#25991;&#20214;&#31995;&#32479;&#20250;&#29992;&#23376;&#22359;&#20998;&#37197;&#21644;&#23614;&#37096;&#21512;&#24182;&#25216;&#26415;&#35299;&#20915;&#23427;&#12290;</p>
<p></p>
<p>&#22359;&#23384;&#20648;&#32463;&#24120;&#30001;&#25991;&#20214;&#31995;&#32479;&#25110;&#25968;&#25454;&#24211;&#31649;&#29702;&#31995;&#32479;&#65288;DBMS&#65289;&#25277;&#35937;&#20986;&#26469;&#65292;&#25552;&#20379;&#32473;&#24212;&#29992;&#31243;&#24207;&#25110;&#26368;&#32456;&#29992;&#25143;&#20351;&#29992;&#12290;&#29289;&#29702;&#25110;&#36923;&#36753;&#21367;&#21487;&#20197;&#36890;&#36807;&#22359;I/O&#35775;&#38382;&#65292;&#32972;&#21518;&#21487;&#33021;&#26159;&#36890;&#36807;SCSI&#25110;&#20809;&#32420;&#36890;&#36947;&#30452;&#25509;&#36830;&#25509;&#26381;&#21153;&#22120;&#30340;&#20869;&#37096;&#35774;&#22791;&#65292;&#25110;&#36890;&#36807;iSCSI&#12289;AoE&#31561;&#21327;&#35758;&#35775;&#38382;&#23384;&#20648;&#21306;&#22495;&#32593;&#32476;&#65288;SAN&#65289;&#30340;&#36828;&#31243;&#35774;&#22791;&#12290;&#25968;&#25454;&#24211;&#31649;&#29702;&#31995;&#32479;&#36890;&#24120;&#20351;&#29992;&#33258;&#24049;&#30340;&#22359;I/O&#65292;&#20197;&#22312;DBMS&#30340;&#25991;&#20214;&#31995;&#32479;&#20043;&#19978;&#25552;&#39640;&#24615;&#33021;&#21644;&#21487;&#24674;&#22797;&#24615;&#12290;</p>
<p></p>
<p><a href="img1.jpg" data-lightbox="set"><img src="img1.jpg" class="kmimg"></a></p>
<p><font size=5 face="ArialMT">A partition, physical drive, is a part of one physical hard drive.</font></p>
<p><font size=5 face="ArialMT">A volume, logical drive, is a single accessible storage area with a single file system.</font></p>
<p></p>
<p></p>
<p><font size=6 face="ArialMT">Cinder allows you to give block level storage to your</font></p>
<p><font size=6 face="ArialMT">OpenStack Compute instances.</font></p>
<p><font size=6 face="ArialMT">&#8211; Extra block device or boot-from-volume device</font></p>
<p><font size=6 face="ArialMT">&#8211; Storage Access Network (SAN)</font></p>
<p><font size=6 face="ArialMT">&#8211; </font><font size=6 face="Arial-BoldMT"><b>Amazon EBS</b></font></p>
<p><font size=6 face="ArialMT">&#8226; The basic Cinder usage is iSCSI-exposed LVM volumes.</font></p>
<p><font size=6 face="ArialMT">&#8211; Two basic default components</font></p>
<p><font size=5 face="ArialMT">&#8226; </font><font size=5 face="Arial-BoldMT"><b>lvm2</b></font></p>
<p><font size=5 face="ArialMT">&#8226; </font><font size=5 face="Arial-BoldMT"><b>open-iscsi/iscsi-target</b></font></p>
<p></p>
<p>&#12304;&#22359;&#23384;&#20648;&#12305;</p>
<p></p>
<p>&#20856;&#22411;&#35774;&#22791;&#65306;&#30913;&#30424;&#38453;&#21015;&#65292;&#30828;&#30424;</p>
<p></p>
<p>&#22359;&#23384;&#20648;&#20027;&#35201;&#26159;&#23558;&#35064;&#30913;&#30424;&#31354;&#38388;&#25972;&#20010;&#26144;&#23556;&#32473;&#20027;&#26426;&#20351;&#29992;&#30340;&#65292;&#23601;&#26159;&#35828;&#20363;&#22914;&#30913;&#30424;&#38453;&#21015;&#37324;&#38754;&#26377;5&#22359;&#30828;&#30424;&#65288;&#20026;&#26041;&#20415;&#35828;&#26126;&#65292;&#20551;&#35774;&#27599;&#20010;&#30828;&#30424;1G&#65289;&#65292;&#28982;&#21518;&#21487;&#20197;&#36890;&#36807;&#21010;&#36923;&#36753;&#30424;&#12289;&#20570;Raid&#12289;&#25110;&#32773;LVM&#65288;&#36923;&#36753;&#21367;&#65289;&#31561;&#31181;&#31181;&#26041;&#24335;&#36923;&#36753;&#21010;&#20998;&#20986;N&#20010;&#36923;&#36753;&#30340;&#30828;&#30424;&#12290;&#65288;&#20551;&#35774;&#21010;&#20998;&#23436;&#30340;&#36923;&#36753;&#30424;&#20063;&#26159;5&#20010;&#65292;&#27599;&#20010;&#20063;&#26159;1G&#65292;&#20294;&#26159;&#36825;5&#20010;1G&#30340;&#36923;&#36753;&#30424;&#24050;&#32463;&#20110;&#21407;&#26469;&#30340;5&#20010;&#29289;&#29702;&#30828;&#30424;&#24847;&#20041;&#23436;&#20840;&#19981;&#21516;&#20102;&#12290;&#20363;&#22914;&#31532;&#19968;&#20010;&#36923;&#36753;&#30828;&#30424;A&#37324;&#38754;&#65292;&#21487;&#33021;&#31532;&#19968;&#20010;200M&#26159;&#26469;&#33258;&#29289;&#29702;&#30828;&#30424;1&#65292;&#31532;&#20108;&#20010;200M&#26159;&#26469;&#33258;&#29289;&#29702;&#30828;&#30424;2&#65292;&#25152;&#20197;&#36923;&#36753;&#30828;&#30424;A&#26159;&#30001;&#22810;&#20010;&#29289;&#29702;&#30828;&#30424;&#36923;&#36753;&#34394;&#26500;&#20986;&#26469;&#30340;&#30828;&#30424;&#12290;&#65289;</p>
<p></p>
<p>&#25509;&#30528;&#22359;&#23384;&#20648;&#20250;&#37319;&#29992;&#26144;&#23556;&#30340;&#26041;&#24335;&#23558;&#36825;&#20960;&#20010;&#36923;&#36753;&#30424;&#26144;&#23556;&#32473;&#20027;&#26426;&#65292;&#20027;&#26426;&#19978;&#38754;&#30340;&#25805;&#20316;&#31995;&#32479;&#20250;&#35782;&#21035;&#21040;&#26377;5&#22359;&#30828;&#30424;&#65292;&#20294;&#26159;&#25805;&#20316;&#31995;&#32479;&#26159;&#21306;&#20998;&#19981;&#20986;&#21040;&#24213;&#26159;&#36923;&#36753;&#36824;&#26159;&#29289;&#29702;&#30340;&#65292;&#23427;&#19968;&#27010;&#23601;&#35748;&#20026;&#21482;&#26159;5&#22359;&#35064;&#30340;&#29289;&#29702;&#30828;&#30424;&#32780;&#24050;&#65292;&#36319;&#30452;&#25509;&#25343;&#19968;&#22359;&#29289;&#29702;&#30828;&#30424;&#25346;&#36733;&#21040;&#25805;&#20316;&#31995;&#32479;&#27809;&#26377;&#21306;&#21035;&#30340;&#65292;&#33267;&#23569;&#25805;&#20316;&#31995;&#32479;&#24863;&#30693;&#19978;&#27809;&#26377;&#21306;&#21035;&#12290;</p>
<p></p>
<p>&#27492;&#31181;&#26041;&#24335;&#19979;&#65292;&#25805;&#20316;&#31995;&#32479;&#36824;&#38656;&#35201;&#23545;&#25346;&#36733;&#30340;&#35064;&#30828;&#30424;&#36827;&#34892;&#20998;&#21306;&#12289;&#26684;&#24335;&#21270;&#21518;&#65292;&#25165;&#33021;&#20351;&#29992;&#65292;&#19982;&#24179;&#24120;&#20027;&#26426;&#20869;&#32622;&#30828;&#30424;&#30340;&#26041;&#24335;&#23436;&#20840;&#26080;&#24322;&#12290;</p>
<p></p>
<p>&#20248;&#28857;&#65306;</p>
<p></p>
<p>1&#12289; &#36825;&#31181;&#26041;&#24335;&#30340;&#22909;&#22788;&#24403;&#28982;&#26159;&#22240;&#20026;&#36890;&#36807;&#20102;Raid&#19982;LVM&#31561;&#25163;&#27573;&#65292;&#23545;&#25968;&#25454;&#25552;&#20379;&#20102;&#20445;&#25252;&#12290;</p>
<p></p>
<p>2&#12289; &#21478;&#22806;&#20063;&#21487;&#20197;&#23558;&#22810;&#22359;&#24265;&#20215;&#30340;&#30828;&#30424;&#32452;&#21512;&#36215;&#26469;&#65292;&#25104;&#20026;&#19968;&#20010;&#22823;&#23481;&#37327;&#30340;&#36923;&#36753;&#30424;&#23545;&#22806;&#25552;&#20379;&#26381;&#21153;&#65292;&#25552;&#39640;&#20102;&#23481;&#37327;&#12290;</p>
<p></p>
<p>3&#12289; &#20889;&#20837;&#25968;&#25454;&#30340;&#26102;&#20505;&#65292;&#30001;&#20110;&#26159;&#22810;&#22359;&#30913;&#30424;&#32452;&#21512;&#20986;&#26469;&#30340;&#36923;&#36753;&#30424;&#65292;&#25152;&#20197;&#20960;&#22359;&#30913;&#30424;&#21487;&#20197;&#24182;&#34892;&#20889;&#20837;&#30340;&#65292;&#25552;&#21319;&#20102;&#35835;&#20889;&#25928;&#29575;&#12290;</p>
<p></p>
<p>4&#12289; &#24456;&#22810;&#26102;&#20505;&#22359;&#23384;&#20648;&#37319;&#29992;SAN&#26550;&#26500;&#32452;&#32593;&#65292;&#20256;&#36755;&#36895;&#29575;&#20197;&#21450;&#23553;&#35013;&#21327;&#35758;&#30340;&#21407;&#22240;&#65292;&#20351;&#24471;&#20256;&#36755;&#36895;&#24230;&#19982;&#35835;&#20889;&#36895;&#29575;&#24471;&#21040;&#25552;&#21319;&#12290;</p>
<p></p>
<p>&#32570;&#28857;&#65306;</p>
<p></p>
<p>1&#12289;&#37319;&#29992;SAN&#26550;&#26500;&#32452;&#32593;&#26102;&#65292;&#38656;&#35201;&#39069;&#22806;&#20026;&#20027;&#26426;&#36141;&#20080;&#20809;&#32420;&#36890;&#36947;&#21345;&#65292;&#36824;&#35201;&#20080;&#20809;&#32420;&#20132;&#25442;&#26426;&#65292;&#36896;&#20215;&#25104;&#26412;&#39640;&#12290;</p>
<p></p>
<p>2&#12289;&#20027;&#26426;&#20043;&#38388;&#30340;&#25968;&#25454;&#26080;&#27861;&#20849;&#20139;&#65292;&#22312;&#26381;&#21153;&#22120;&#19981;&#20570;&#38598;&#32676;&#30340;&#24773;&#20917;&#19979;&#65292;&#22359;&#23384;&#20648;&#35064;&#30424;&#26144;&#23556;&#32473;&#20027;&#26426;&#65292;&#20877;&#26684;&#24335;&#21270;&#20351;&#29992;&#21518;&#65292;&#23545;&#20110;&#20027;&#26426;&#26469;&#35828;&#30456;&#24403;&#20110;&#26412;&#22320;&#30424;&#65292;&#37027;&#20040;&#20027;&#26426;A&#30340;&#26412;&#22320;&#30424;&#26681;&#26412;&#19981;&#33021;&#32473;&#20027;&#26426;B&#21435;&#20351;&#29992;&#65292;&#26080;&#27861;&#20849;&#20139;&#25968;&#25454;&#12290;</p>
<p></p>
<p>3&#12289;&#19981;&#21033;&#20110;&#19981;&#21516;&#25805;&#20316;&#31995;&#32479;&#20027;&#26426;&#38388;&#30340;&#25968;&#25454;&#20849;&#20139;&#65306;&#21478;&#22806;&#19968;&#20010;&#21407;&#22240;&#26159;&#22240;&#20026;&#25805;&#20316;&#31995;&#32479;&#20351;&#29992;&#19981;&#21516;&#30340;&#25991;&#20214;&#31995;&#32479;&#65292;&#26684;&#24335;&#21270;&#23436;&#20043;&#21518;&#65292;&#19981;&#21516;&#25991;&#20214;&#31995;&#32479;&#38388;&#30340;&#25968;&#25454;&#26159;&#20849;&#20139;&#19981;&#20102;&#30340;&#12290;&#20363;&#22914;&#19968;&#21488;&#35013;&#20102;WIN7/XP&#65292;&#25991;&#20214;&#31995;&#32479;&#26159;FAT32/NTFS&#65292;&#32780;Linux&#26159;EXT4&#65292;EXT4&#26159;&#26080;&#27861;&#35782;&#21035;NTFS&#30340;&#25991;&#20214;&#31995;&#32479;&#30340;&#12290;&#23601;&#20687;&#19968;&#21482;NTFS&#26684;&#24335;&#30340;U&#30424;&#65292;&#25554;&#36827;Linux&#30340;&#31508;&#35760;&#26412;&#65292;&#26681;&#26412;&#26080;&#27861;&#35782;&#21035;&#20986;&#26469;&#12290;&#25152;&#20197;&#19981;&#21033;&#20110;&#25991;&#20214;&#20849;&#20139;&#12290;</p>
<p></p>
<p>&#12304;&#25991;&#20214;&#23384;&#20648;&#12305;</p>
<p></p>
<p>&#20856;&#22411;&#35774;&#22791;&#65306;FTP&#12289;NFS&#26381;&#21153;&#22120;</p>
<p></p>
<p>&#20026;&#20102;&#20811;&#26381;&#19978;&#36848;&#25991;&#20214;&#26080;&#27861;&#20849;&#20139;&#30340;&#38382;&#39064;&#65292;&#25152;&#20197;&#26377;&#20102;&#25991;&#20214;&#23384;&#20648;&#12290;</p>
<p></p>
<p>&#25991;&#20214;&#23384;&#20648;&#20063;&#26377;&#36719;&#30828;&#19968;&#20307;&#21270;&#30340;&#35774;&#22791;&#65292;&#20294;&#26159;&#20854;&#23454;&#26222;&#36890;&#25343;&#19968;&#21488;&#26381;&#21153;&#22120;/&#31508;&#35760;&#26412;&#65292;&#21482;&#35201;&#35013;&#19978;&#21512;&#36866;&#30340;&#25805;&#20316;&#31995;&#32479;&#19982;&#36719;&#20214;&#65292;&#23601;&#21487;&#20197;&#26550;&#35774;FTP&#19982;NFS&#26381;&#21153;&#20102;&#65292;&#26550;&#19978;&#35813;&#31867;&#26381;&#21153;&#20043;&#21518;&#30340;&#26381;&#21153;&#22120;&#65292;&#23601;&#26159;&#25991;&#20214;&#23384;&#20648;&#30340;&#19968;&#31181;&#20102;&#12290;</p>
<p></p>
<p>&#20027;&#26426;A&#21487;&#20197;&#30452;&#25509;&#23545;&#25991;&#20214;&#23384;&#20648;&#36827;&#34892;&#25991;&#20214;&#30340;&#19978;&#20256;&#19979;&#36733;&#65292;&#19982;&#22359;&#23384;&#20648;&#19981;&#21516;&#65292;&#20027;&#26426;A&#26159;&#19981;&#38656;&#35201;&#20877;&#23545;&#25991;&#20214;&#23384;&#20648;&#36827;&#34892;&#26684;&#24335;&#21270;&#30340;&#65292;&#22240;&#20026;&#25991;&#20214;&#31649;&#29702;&#21151;&#33021;&#24050;&#32463;&#30001;&#25991;&#20214;&#23384;&#20648;&#33258;&#24049;&#25630;&#23450;&#20102;&#12290;</p>
<p></p>
<p>&#20248;&#28857;&#65306;</p>
<p></p>
<p>1&#12289;&#36896;&#20215;&#20132;&#20302;&#65306;&#38543;&#20415;&#19968;&#21488;&#26426;&#22120;&#23601;&#21487;&#20197;&#20102;&#65292;&#21478;&#22806;&#26222;&#36890;&#20197;&#22826;&#32593;&#23601;&#21487;&#20197;&#65292;&#26681;&#26412;&#19981;&#38656;&#35201;&#19987;&#29992;&#30340;SAN&#32593;&#32476;&#65292;&#25152;&#20197;&#36896;&#20215;&#20302;&#12290;</p>
<p></p>
<p>2&#12289;&#26041;&#20415;&#25991;&#20214;&#20849;&#20139;&#65306;&#20363;&#22914;&#20027;&#26426;A&#65288;WIN7&#65292;NTFS&#25991;&#20214;&#31995;&#32479;&#65289;&#65292;&#20027;&#26426;B&#65288;Linux&#65292;EXT4&#25991;&#20214;&#31995;&#32479;&#65289;&#65292;&#24819;&#20114;&#25335;&#19968;&#37096;&#30005;&#24433;&#65292;&#26412;&#26469;&#19981;&#34892;&#12290;&#21152;&#20102;&#20010;&#20027;&#26426;C&#65288;NFS&#26381;&#21153;&#22120;&#65289;&#65292;&#28982;&#21518;&#21487;&#20197;&#20808;A&#25335;&#21040;C&#65292;&#20877;C&#25335;&#21040;B&#23601;OK&#20102;&#12290;&#65288;&#20363;&#23376;&#27604;&#36739;&#32932;&#27973;&#65292;&#35831;&#35265;&#35845;&#8230;&#8230;&#65289;</p>
<p></p>
<p>&#32570;&#28857;&#65306;</p>
<p></p>
<p>&#35835;&#20889;&#36895;&#29575;&#20302;&#65292;&#20256;&#36755;&#36895;&#29575;&#24930;&#65306;&#20197;&#22826;&#32593;&#65292;&#19978;&#20256;&#19979;&#36733;&#36895;&#24230;&#36739;&#24930;&#65292;&#21478;&#22806;&#25152;&#26377;&#35835;&#20889;&#37117;&#35201;1&#21488;&#26381;&#21153;&#22120;&#37324;&#38754;&#30340;&#30828;&#30424;&#26469;&#25215;&#25285;&#65292;&#30456;&#27604;&#36215;&#30913;&#30424;&#38453;&#21015;&#21160;&#19981;&#21160;&#23601;&#20960;&#21313;&#19978;&#30334;&#22359;&#30828;&#30424;&#21516;&#26102;&#35835;&#20889;&#65292;&#36895;&#29575;&#24930;&#20102;&#35768;&#22810;&#12290;</p>
<p></p>
<p>&#12304;&#23545;&#35937;&#23384;&#20648;&#12305;</p>
<p></p>
<p>&#20856;&#22411;&#35774;&#22791;&#65306;&#20869;&#32622;&#22823;&#23481;&#37327;&#30828;&#30424;&#30340;&#20998;&#24067;&#24335;&#26381;&#21153;&#22120;</p>
<p></p>
<p>&#23545;&#35937;&#23384;&#20648;&#26368;&#24120;&#29992;&#30340;&#26041;&#26696;&#65292;&#23601;&#26159;&#22810;&#21488;&#26381;&#21153;&#22120;&#20869;&#32622;&#22823;&#23481;&#37327;&#30828;&#30424;&#65292;&#20877;&#35013;&#19978;&#23545;&#35937;&#23384;&#20648;&#36719;&#20214;&#65292;&#28982;&#21518;&#20877;&#39069;&#22806;&#25630;&#20960;&#21488;&#26381;&#21153;&#20316;&#20026;&#31649;&#29702;&#33410;&#28857;&#65292;&#23433;&#35013;&#19978;&#23545;&#35937;&#23384;&#20648;&#31649;&#29702;&#36719;&#20214;&#12290;&#31649;&#29702;&#33410;&#28857;&#21487;&#20197;&#31649;&#29702;&#20854;&#20182;&#26381;&#21153;&#22120;&#23545;&#22806;&#25552;&#20379;&#35835;&#20889;&#35775;&#38382;&#21151;&#33021;&#12290;</p>
<p></p>
<p>&#20043;&#25152;&#20197;&#20986;&#29616;&#20102;&#23545;&#35937;&#23384;&#20648;&#36825;&#31181;&#19996;&#35199;&#65292;&#26159;&#20026;&#20102;&#20811;&#26381;&#22359;&#23384;&#20648;&#19982;&#25991;&#20214;&#23384;&#20648;&#21508;&#33258;&#30340;&#32570;&#28857;&#65292;&#21457;&#25196;&#23427;&#20457;&#21508;&#33258;&#30340;&#20248;&#28857;&#12290;&#31616;&#21333;&#26469;&#35828;&#22359;&#23384;&#20648;&#35835;&#20889;&#24555;&#65292;&#19981;&#21033;&#20110;&#20849;&#20139;&#65292;&#25991;&#20214;&#23384;&#20648;&#35835;&#20889;&#24930;&#65292;&#21033;&#20110;&#20849;&#20139;&#12290;&#33021;&#21542;&#24324;&#19968;&#20010;&#35835;&#20889;&#24555;&#65292;&#21033; &#20110;&#20849;&#20139;&#30340;&#20986;&#26469;&#21602;&#12290;&#20110;&#26159;&#23601;&#26377;&#20102;&#23545;&#35937;&#23384;&#20648;&#12290;</p>
<p></p>
<p>&#39318;&#20808;&#65292;&#19968;&#20010;&#25991;&#20214;&#21253;&#21547;&#20102;&#20102;&#23646;&#24615;&#65288;&#26415;&#35821;&#21483;metadata&#65292;&#20803;&#25968;&#25454;&#65292;&#20363;&#22914;&#35813;&#25991;&#20214;&#30340;&#22823;&#23567;&#12289;&#20462;&#25913;&#26102;&#38388;&#12289;&#23384;&#20648;&#36335;&#24452;&#31561;&#65289;&#20197;&#21450;&#20869;&#23481;&#65288;&#20197;&#19979;&#31616;&#31216;&#25968;&#25454;&#65289;&#12290;</p>
<p></p>
<p>&#20197;&#24448;&#20687;FAT32&#36825;&#31181;&#25991;&#20214;&#31995;&#32479;&#65292;&#26159;&#30452;&#25509;&#23558;&#19968;&#20221;&#25991;&#20214;&#30340;&#25968;&#25454;&#19982;metadata&#19968;&#36215;&#23384;&#20648;&#30340;&#65292;&#23384;&#20648;&#36807;&#31243;&#20808;&#23558;&#25991;&#20214;&#25353;&#29031;&#25991;&#20214;&#31995;&#32479;&#30340;&#26368;&#23567;&#22359;&#22823;&#23567;&#26469;&#25171;&#25955;&#65288;&#22914;4M&#30340;&#25991;&#20214;&#65292;&#20551;&#35774;&#25991;&#20214;&#31995;&#32479;&#35201;&#27714;&#19968;&#20010;&#22359;4K&#65292;&#37027;&#20040;&#23601;&#23558;&#25991;&#20214;&#25171;&#25955;&#25104;&#20026;1000&#20010;&#23567;&#22359;&#65289;&#65292;&#20877;&#20889;&#36827;&#30828;&#30424;&#37324;&#38754;&#65292;&#36807;&#31243;&#20013;&#27809;&#26377;&#21306;&#20998;&#25968;&#25454;/metadata&#30340;&#12290;&#32780;&#27599;&#20010;&#22359;&#26368;&#21518;&#20250;&#21578;&#30693;&#20320;&#19979;&#19968;&#20010;&#35201;&#35835;&#21462;&#30340;&#22359;&#30340;&#22320;&#22336;&#65292;&#28982;&#21518;&#19968;&#30452;&#36825;&#26679;&#39034;&#24207;&#22320;&#25353;&#22270;&#32034;&#39589;&#65292;&#26368;&#21518;&#23436;&#25104;&#25972;&#20221;&#25991;&#20214;&#30340;&#25152;&#26377;&#22359;&#30340;&#35835;&#21462;&#12290;</p>
<p></p>
<p>&#36825;&#31181;&#24773;&#20917;&#19979;&#35835;&#20889;&#36895;&#29575;&#24456;&#24930;&#65292;&#22240;&#20026;&#23601;&#31639;&#20320;&#26377;100&#20010;&#26426;&#26800;&#25163;&#33218;&#22312;&#35835;&#20889;&#65292;&#20294;&#26159;&#30001;&#20110;&#20320;&#21482;&#26377;&#35835;&#21462;&#21040;&#31532;&#19968;&#20010;&#22359;&#65292;&#25165;&#33021;&#30693;&#36947;&#19979;&#19968;&#20010;&#22359;&#22312;&#21738;&#37324;&#65292;&#20854;&#23454;&#30456;&#24403;&#20110;&#21482;&#33021;&#26377;1&#20010;&#26426;&#26800;&#25163;&#33218;&#22312;&#23454;&#38469;&#24037;&#20316;&#12290;</p>
<p></p>
<p>&#32780;&#23545;&#35937;&#23384;&#20648;&#21017;&#23558;&#20803;&#25968;&#25454;&#29420;&#31435;&#20102;&#20986;&#26469;&#65292;&#25511;&#21046;&#33410;&#28857;&#21483;&#20803;&#25968;&#25454;&#26381;&#21153;&#22120;&#65288;&#26381;&#21153;&#22120;+&#23545;&#35937;&#23384;&#20648;&#31649;&#29702;&#36719;&#20214;&#65289;&#65292;&#37324;&#38754;&#20027;&#35201;&#36127;&#36131;&#23384;&#20648;&#23545;&#35937;&#30340;&#23646;&#24615;&#65288;&#20027;&#35201;&#26159;&#23545;&#35937;&#30340;&#25968;&#25454;&#34987;&#25171;&#25955;&#23384;&#25918;&#21040;&#20102;&#37027;&#20960;&#21488;&#20998;&#24067;&#24335;&#26381;&#21153;&#22120;&#20013;&#30340;&#20449;&#24687;&#65289;&#65292;&#32780;&#20854;&#20182;&#36127;&#36131;&#23384;&#20648;&#25968;&#25454;&#30340;&#20998;&#24067;&#24335;&#26381;&#21153;&#22120;&#21483;&#20570;OSD&#65292;&#20027;&#35201;&#36127;&#36131;&#23384;&#20648;&#25991;&#20214;&#30340;&#25968;&#25454;&#37096;&#20998;&#12290;&#24403;&#29992;&#25143;&#35775;&#38382;&#23545;&#35937;&#65292;&#20250;&#20808;&#35775;&#38382;&#20803;&#25968;&#25454;&#26381;&#21153;&#22120;&#65292;&#20803;&#25968;&#25454;&#26381;&#21153;&#22120;&#21482;&#36127;&#36131;&#21453;&#39304;&#23545;&#35937;&#23384;&#20648;&#22312;&#21738;&#20123;OSD&#65292;&#20551;&#35774;&#21453;&#39304;&#25991;&#20214;A&#23384;&#20648;&#22312;B&#12289;C&#12289;D&#19977;&#21488;OSD&#65292;&#37027;&#20040;&#29992;&#25143;&#23601;&#20250;&#20877;&#27425;&#30452;&#25509;&#35775;&#38382;3&#21488;OSD&#26381;&#21153;&#22120;&#21435;&#35835;&#21462;&#25968;&#25454;&#12290;</p>
<p></p>
<p>&#36825;&#26102;&#20505;&#30001;&#20110;&#26159;3&#21488;OSD&#21516;&#26102;&#23545;&#22806;&#20256;&#36755;&#25968;&#25454;&#65292;&#25152;&#20197;&#20256;&#36755;&#30340;&#36895;&#24230;&#23601;&#21152;&#24555;&#20102;&#12290;&#24403;OSD&#26381;&#21153;&#22120;&#25968;&#37327;&#36234;&#22810;&#65292;&#36825;&#31181;&#35835;&#20889;&#36895;&#24230;&#30340;&#25552;&#21319;&#23601;&#36234;&#22823;&#65292;&#36890;&#36807;&#27492;&#31181;&#26041;&#24335;&#65292;&#23454;&#29616;&#20102;&#35835;&#20889;&#24555;&#30340;&#30446;&#30340;&#12290;</p>
<p></p>
<p>&#21478;&#19968;&#26041;&#38754;&#65292;&#23545;&#35937;&#23384;&#20648;&#36719;&#20214;&#26159;&#26377;&#19987;&#38376;&#30340;&#25991;&#20214;&#31995;&#32479;&#30340;&#65292;&#25152;&#20197;OSD&#23545;&#22806;&#21448;&#30456;&#24403;&#20110;&#25991;&#20214;&#26381;&#21153;&#22120;&#65292;&#37027;&#20040;&#23601;&#19981;&#23384;&#22312;&#25991;&#20214;&#20849;&#20139;&#26041;&#38754;&#30340;&#22256;&#38590;&#20102;&#65292;&#20063;&#35299;&#20915;&#20102;&#25991;&#20214;&#20849;&#20139;&#26041;&#38754;&#30340;&#38382;&#39064;&#12290;</p>
<p></p>
<p>&#25152;&#20197;&#23545;&#35937;&#23384;&#20648;&#30340;&#20986;&#29616;&#65292;&#24456;&#22909;&#22320;&#32467;&#21512;&#20102;&#22359;&#23384;&#20648;&#19982;&#25991;&#20214;&#23384;&#20648;&#30340;&#20248;&#28857;&#12290;</p>
<p></p>
<p>&#26368;&#21518;&#20026;&#20160;&#20040;&#23545;&#35937;&#23384;&#20648;&#20860;&#20855;&#22359;&#23384;&#20648;&#19982;&#25991;&#20214;&#23384;&#20648;&#30340;&#22909;&#22788;&#65292;&#36824;&#35201;&#20351;&#29992;&#22359;&#23384;&#20648;&#25110;&#25991;&#20214;&#23384;&#20648;&#21602;&#65311;</p>
<p></p>
<p>1&#12289;&#26377;&#19968;&#31867;&#24212;&#29992;&#26159;&#38656;&#35201;&#23384;&#20648;&#30452;&#25509;&#35064;&#30424;&#26144;&#23556;&#30340;&#65292;&#20363;&#22914;&#25968;&#25454;&#24211;&#12290;&#22240;&#20026;&#25968;&#25454;&#24211;&#38656;&#35201;&#23384;&#20648;&#35064;&#30424;&#26144;&#23556;&#32473;&#33258;&#24049;&#21518;&#65292;&#20877;&#26681;&#25454;&#33258;&#24049;&#30340;&#25968;&#25454;&#24211;&#25991;&#20214;&#31995;&#32479;&#26469;&#23545;&#35064;&#30424;&#36827;&#34892;&#26684;&#24335;&#21270;&#30340;&#65292;&#25152;&#20197;&#26159;&#19981;&#33021;&#22815;&#37319;&#29992;&#20854;&#20182;&#24050;&#32463;&#34987;&#26684;&#24335;&#21270;&#20026;&#26576;&#31181;&#25991;&#20214;&#31995;&#32479;&#30340;&#23384;&#20648;&#30340;&#12290;&#27492;&#31867;&#24212;&#29992;&#26356;&#36866;&#21512;&#20351;&#29992;&#22359;&#23384;&#20648;&#12290;</p>
<p></p>
<p>2&#12289;&#23545;&#35937;&#23384;&#20648;&#30340;&#25104;&#26412;&#27604;&#36215;&#26222;&#36890;&#30340;&#25991;&#20214;&#23384;&#20648;&#36824;&#26159;&#36739;&#39640;&#65292;&#38656;&#35201;&#36141;&#20080;&#19987;&#38376;&#30340;&#23545;&#35937;&#23384;&#20648;&#36719;&#20214;&#20197;&#21450;&#22823;&#23481;&#37327;&#30828;&#30424;&#12290;&#22914;&#26524;&#23545;&#25968;&#25454;&#37327;&#35201;&#27714;&#19981;&#26159;&#28023;&#37327;&#65292;&#21482;&#26159;&#20026;&#20102;&#20570;&#25991;&#20214;&#20849;&#20139;&#30340;&#26102;&#20505;&#65292;&#30452;&#25509;&#29992;&#25991;&#20214;&#23384;&#20648;&#30340;&#24418;&#24335;&#22909;&#20102;&#65292;&#24615;&#20215;&#27604;&#39640;&#12290;</p>
<p></p>
<p></p>
<p></p>
<p>&#30693;&#20046;&#29992;&#25143;&#12289;Allen Tony &#36190;&#21516;</p>
<p></p>
<p>&#39318;&#20808;&#25105;&#20204;&#20808;&#26469;&#20102;&#35299;&#19968;&#19979;&#65292;&#20160;&#20040;&#21483;&#20570;&#22359;&#32423;&#65311;&#20160;&#20040;&#21483;&#25991;&#20214;&#32423;&#65311;</p>
<p></p>
<p>1.&#22359;&#32423;&#27010;&#24565;&#65306;</p>
<p></p>
<p>&#22359;&#32423;&#26159;&#25351;&#20197;&#25159;&#21306;&#20026;&#22522;&#30784;&#65292;&#19968;&#20010;&#25110;&#25105;&#36830;&#32493;&#30340;&#25159;&#21306;&#32452;&#25104;&#19968;&#20010;&#22359;&#65292;&#20063;&#21483;&#29289;&#29702;&#22359;&#12290;&#23427;&#26159;&#22312;&#25991;&#20214;&#31995;&#32479;&#19982;&#22359;&#35774;&#22791;&#65288;&#20363;&#22914;&#65306;&#30913;&#30424;&#39537;&#21160;&#22120;&#65289;&#20043;&#38388;&#12290;</p>
<p></p>
<p>2.&#25991;&#20214;&#32423;&#27010;&#24565;&#65306;</p>
<p></p>
<p>&#25991;&#20214;&#32423;&#26159;&#25351;&#25991;&#20214;&#31995;&#32479;&#65292;&#21333;&#20010;&#25991;&#20214;&#21487;&#33021;&#30001;&#20110;&#19968;&#20010;&#25110;&#22810;&#20010;&#36923;&#36753;&#22359;&#32452;&#25104;&#65292;&#19988;&#36923;&#36753;&#22359;&#20043;&#38388;&#26159;&#19981;&#36830;&#32493;&#20998;&#24067;&#12290;&#36923;&#36753;&#22359;&#22823;&#20110;&#25110;&#31561;&#20110;&#29289;&#29702;&#22359;&#25972;&#25968;&#20493;&#65292;</p>
<p></p>
<p>3.&#29289;&#29702;&#22359;&#19982;&#25991;&#20214;&#31995;&#32479;&#20043;&#38388;&#30340;&#20851;&#31995;&#22270;&#65306;</p>
<p></p>
<p>&#26144;&#23556;&#20851;&#31995;&#65306;&#25159;&#21306;&#8594;&#29289;&#29702;&#22359;&#8594;&#36923;&#36753;&#22359;&#8594;&#25991;&#20214;&#31995;&#32479;</p>
<p></p>
<p>&#25991;&#20214;&#32423;&#22791;&#20221;&#65306;</p>
<p></p>
<p>&#25991;&#20214;&#32423;&#22791;&#20221;&#26159;&#25351;&#22312;&#25351;&#23450;&#26576;&#20123;&#25991;&#20214;&#36827;&#34892;&#22791;&#20221;&#26102;&#65292;&#39318;&#20808;&#20250;&#26597;&#25214;&#27599;&#20010;&#25991;&#20214;&#36923;&#36753;&#22359;&#65292;&#20854;&#27425;&#29289;&#29702;&#22359;&#65292;&#30001;&#20110;&#36923;&#36753;&#22359;&#26159;&#20998;&#25955;&#22312;&#29289;&#29702;&#22359;&#19978;&#65292;&#32780;&#29289;&#29702;&#22359;&#20063;&#26159;&#20998;&#25955;&#22312;&#19981;&#21516;&#25159;&#21306;&#19978;&#12290;&#38656;&#35201;&#19968;&#23618;&#19968; &#23618;&#24448;&#19979;&#26597;&#25214;&#65292;&#26368;&#21518;&#25165;&#23436;&#25104;&#25972;&#20010;&#25991;&#20214;&#22797;&#21046;&#12290;&#25991;&#20214;&#32423;&#22791;&#20221;&#26102;&#27604;&#36739;&#36153;&#26102;&#38388;&#65292;&#25928;&#29575;&#19981;&#39640;&#65292;&#23454;&#26102;&#24615;&#19981;&#24378;&#65292;&#22791;&#20221;&#26102;&#38388;&#38271;&#65292;&#19988;&#22686;&#37327;&#22791;&#20221;&#26102;&#65292;&#21333;&#25991;&#20214;&#26576;&#19968;&#23567;&#37096;&#20221;&#20462;&#25913;&#65292;&#19981;&#20250;&#21482;&#22791;&#20221;&#20462;&#25913; &#37096;&#20221;&#65292;&#32780;&#25972;&#20010;&#25991;&#20214;&#37117;&#22791;&#20221;&#12290;</p>
<p></p>
<p>&#22359;&#32423;&#22791;&#20221;&#65306;</p>
<p></p>
<p>&#22359;&#32423;&#22791;&#20221;&#26159;&#25351;&#29289;&#29702;&#22359;&#22797;&#21046;&#65292;&#25928;&#29575;&#39640;&#65292;&#23454;&#26102;&#24615;&#24378;&#65292;&#22791;&#20221;&#26102;&#38388;&#30701;&#65292;&#19988;&#22686;&#37327;&#22791;&#20221;&#26102;&#65292;&#21482;&#22791;&#20221;&#20462;&#25913;&#36807;&#30340;&#29289;&#29702;&#22359;&#12290;</p>
<p></p>
<p>&#30446;&#21069;&#25991;&#20214;&#32423;&#22791;&#20221;&#24037;&#20855;&#65306;</p>
<p></p>
<p>Symantec NBU/BE &#22791;&#20221;&#36719;&#20214;&#12289;Commvault&#12289;CA&#12289;Networker</p>
<p></p>
<p>&#30446;&#21069;&#22359;&#32423;&#22791;&#20221;&#24037;&#20855;&#65306;</p>
<p></p>
<p>&#39134;&#24247;CDP&#12289;Recoverpoint&#12289;&#26477;&#24030;&#20449;&#26680;CDP&#12289;Novell CDP</p>
<p></p>
<p>&#22791;&#20221;&#26102;&#38388;&#28857;&#20445;&#30041;&#21608;&#26399;&#65306;</p>
<p></p>
<p>&#20256;&#32479;&#22791;&#20221;&#36719;&#20214;&#65288;&#25991;&#20214;&#32423;&#22791;&#20221;&#65289;&#65292;&#21487;&#20197;&#20445;&#30041;&#22791;&#20221;&#26102;&#38388;&#28857;&#22810;&#65292;&#24674;&#22797;&#39063;&#31890;&#24230;&#22823;</p>
<p></p>
<p>CDP&#22791;&#20221;&#65288;&#22359;&#32423;&#22791;&#20221;&#65289;&#65292;&#21487;&#20197;&#20445;&#30041;&#22791;&#20221;&#26102;&#38388;&#28857;&#23569;&#65292;&#24674;&#22797;&#39063;&#31890;&#24230;&#23567;</p>
<p>&#21457;&#24067;&#20110; 2015-03-02 &#28155;&#21152;&#35780;&#35770;</p>
<p>philosopher w</p>
<p>&#20010;&#20154;&#29702;&#35299;&#12290;</p>
<p>&#22359;&#23384;&#20648;&#23601;&#26159;&#20107;&#20808;&#22312;&#23384;&#20648;&#31354;&#38388;&#20013;&#30011;&#22909;&#25972;&#40784;&#30340;&#26684;&#23376;&#65288;&#26684;&#24335;&#21270;&#65289;&#65292;&#28982;&#21518;&#20197;&#19968;&#20010;&#26684;&#23376;&#20026;&#26368;&#23567;&#21333;&#20301;&#36827;&#34892;&#23384;&#21462;&#65292;&#21363;&#27599;&#27425;&#23384;&#21462;&#33267;&#23569;&#28041;&#21450;&#19968;&#20010;&#26684;&#23376;&#30340;&#31354;&#38388;&#12290;</p>
<p>&#25991;&#20214;&#23384;&#20648;&#23601;&#26159;&#36890;&#24120;&#20351;&#29992;&#30340;ntfs&#12289;fat&#12289;ext&#31561;&#25991;&#20214;&#31995;&#32479;&#65292;&#20197;&#25991;&#20214;&#20026;&#21333;&#20301;&#36827;&#34892;&#23384;&#21462;&#12290;</p>
<p>&#22810;&#25968;&#25991;&#20214;&#31995;&#32479;&#24314;&#31435;&#22312;&#22359;&#23384;&#20648;&#20043;&#19978;&#12290;&#20855;&#20307;&#22320;&#35828;&#65292;&#25805;&#20316;&#31995;&#32479;&#26159;&#30913;&#30424;&#30340;&#30452;&#25509;&#20351;&#29992;&#32773;&#65288;&#36890;&#36807;&#30913;&#30424;&#25552;&#20379;&#30340;&#21407;&#22987;&#25509;&#21475;&#20351;&#29992;&#30913;&#30424;&#65289;&#65292;&#25805;&#20316;&#31995;&#32479;&#22312;&#20351;&#29992;&#30913;&#30424;&#31354;&#38388;&#26102;&#20351;&#29992;&#22359;&#23384;&#20648;&#65292;&#24403;&#26377;&#20869;&#23384;&#20013;&#30340;&#25968;&#25454;&#35201;&#20889;&#20837;&#30913;&#30424;&#26102;&#65292;&#25805;&#20316;&#31995;&#32479;</p>
<p></p>
<p></p>
<p></p>
<p></p>
<p></p>
<p></p>
<p>Block, File and Object Storage</p>
<p>Before introducing the Seagate Kinetic Open Storage platform, understand the distinctions between block, file and object storage.</p>
<p>Comparison Table of Block, File and Object Storage</p>
<p> </p>
<p>Block Storage</p>
<p>File Storage</p>
<p>Object Storage</p>
<p>Reference mechanismLogical block address (LBA) on a device or logical unitNamed file in a directory in a tree of named directoriesObject name or key on an object serverAtomic unit of accessBlock, 512 or 4096 bytes</p>
<p>ByteObject valueAccess semanticswrite, read, trimopen, write, read, position, insert, append, close, etc.put, get, deleteRelationship semanticsLBA x+1 is the fastest block to access after LBA xFiles in the same directory are relatedKey x and Key y are related for "sequential" keys x and y where there is no other key z such that x &lt; z &lt; y.Scaling limitsLimited to blocks on a single deviceLimited to files in a single file systemLimited to object on a single object server</p>
<p> </p>
<p> </p>
<p>Block StorageDisk drives (HDD) and solid state drives (SSD) present a block access model through a block command set such as ATA or SCSI.</p>
<p>Characteristics of block storage:</p>
<p></p>
<p>    * The drive provides a set of logical blocks.</p>
<p></p>
<p>        * Each block is the same size, typically 512 or 4096 bytes.</p>
<p></p>
<p>    * Blocks are addressed by a logical block address (LBA).</p>
<p></p>
<p>        * Addressing is typically non-sparse, from 0 to N-1 for a drive with N blocks.</p>
<p></p>
<p>    * LBA X and LBA X+1 have the relationship that access for the pair is almost always faster than access for any other pair of LBAs.</p>
<p></p>
<p>        * By induction, this extends to any tuple (LBA X, LBA X+1, LBA X+2, ...).</p>
<p></p>
<p>    * Data access commands typically specify a first LBA and a count.</p>
<p></p>
<p>        * This leverages the relationship just defined.</p>
<p></p>
<p>    * Lower LBAs often have higher data throughput rates.</p>
<p></p>
<p>        * This does not apply to SSD and some HDD schemes.</p>
<p></p>
<p>    * The data integrity model is that a read returns the data last written.</p>
<p></p>
<p>        * Extensions to this model include the Trim (ATA) and Unmap (SCSI) commands.</p>
<p></p>
<p></p>
<p>File StorageFile systems provide storage of files, typically on block storage devices. Portable Operating System Interface (POSIX) File Systems is the most common standard for a file system API.</p>
<p>Characteristics of file storage:</p>
<p></p>
<p>    * Files are an arbitrary number of bytes.</p>
<p></p>
<p>        * Real file systems typically have some well known maximum size.</p>
<p></p>
<p>    * Files are referenced by a directory tree that starts with the device as the root, has named directories and intermediate nodes, and named files as leaf nodes.</p>
<p></p>
<p>        * In many systems a directory can be used as a virtual tree root.</p>
<p></p>
<p>    * File systems have responsibility for storing the directory tree, the file data, and any other information it needs to accomplish those tasks.</p>
<p>    * File systems manage the space allocation for the underlying storage.</p>
<p></p>
<p>        * For block storage this means that the file system decides which logical blocks are part of which files, and in what order.</p>
<p></p>
<p>    * File semantics include the following.</p>
<p></p>
<p>        * create (with a specified parent and file name)</p>
<p>        * open</p>
<p>        * close</p>
<p>        * delete</p>
<p>        * rename (change file name)</p>
<p>        * move (change location in directory tree)</p>
<p>        * position or seek</p>
<p>        * read (at position, implicitly incrementing the position)</p>
<p>        * write (at position, implicitly incrementing the position)</p>
<p>        * insert (at position, implicitly not incrementing the position)</p>
<p></p>
<p></p>
<p>Object StorageObject storage systems provide storage of data as objects. Today's object storage systems typically store objects as one or more files. Amazon S3 and Open Stack Swift are two examples of object storage systems.</p>
<p>Characteristics of object storage:</p>
<p></p>
<p>    * Objects are an arbitrary number of bytes.</p>
<p></p>
<p>        * Real object storage systems typically have some well known maximum size.</p>
<p></p>
<p>    * Objects are referenced by a name or key selected by the creator.</p>
<p>    * Keys do not have any relationship to each other.</p>
<p></p>
<p>        * Some systems have manifests that describe a set of objects that make up a larger object.</p>
<p>        * Some systems maintain an ordering of keys according to some collation rule such as strict numeric order.</p>
<p></p>
<p>    * Object semantics include the following.</p>
<p></p>
<p>        * put</p>
<p>        * get</p>
<p></p>
<p></p>
<p></p>
</font>
<div data-role="controlgroup" data-type="horizontal" style="float:right; padding-right:25px"><a href="../../index.html" rel="external" data-role="button" data-icon="home">目录</a><a href="../002/001.html" rel="external" data-role="button">上一篇</a><a href="../003/001.html" rel="external" data-role="button">下一篇</a></div><div style="clear:both"></div></div><div data-role="footer"><h1><a href="http://www.kmapk.com" rel="external">版权所有 @ KM盒子</a></h1></div></div></body></html>
